class Theory:
    theory_6: dict[str, dict[int, tuple[str, str, str]]] = {
            "база": {
                1: ("Разность квадратов:", "a^2 - b^2 = (a - b)(a + b)", ""),
                2: ("Квадрат разности:", "(a - b)^2 = a^2 - 2ab + b^2", ""),
                3: ("Квадрат суммы:", "(a + b)^2 = a^2 + 2ab + b^2", ""),
                4: ("Сумма кубов:", "a^3 + b^3 = (a + b)(a^2 - ab + b^2)", "")},
            "степень": {
                1: ("a^n * a^m =", "a^n+m", ""),
                2: ("a^n : a^m =", "a^n-m", ""),
                3: ("(a^n)^m =", "a^n*m", "").
                4: ("a^n * b^n =", "(ab)^n", ""),
                5: ("a^n/b^n =", "(a/b)^n", ""),
                6: ("a^0 =", "1", ""),
                7: ("a^-n =", "1/a^n", ""),
                8: ("(a/b)^-n =", "(b/h)^n", "")},
            "корни": {
                1: ("sqrt(a) * sqrt(b) =", "sqrt(a*b)", ""),
                2: ("sqrt(a) / sqrt(b) =", "sqrt(a/b)", ""),
                3: ("sqrt(a)^2 =", "a", ""),
                4: ("sqrt(a^2) =", "|a|", ""),
                5: ("sqrtn(a^m) =", "a^m/n", "")},
            "приведение": {
                1: ("sin(p/2 - a) =", "cos(a)", ",\np/2 => функция меняется на кофункцию"),
                2: ("tg(p + a) =", "tg(a)", ",\np => функция не меняется на кофункцию"),
                3: ("sin(3p/2 + a) =", "-cos(a)", ",\n3p/2 - IV четверть, в которой синус имеет отрицательный знак => знак меняется"),
                4: ("-cos(3p/2 + a) =", "sin(a)", "\n3p/2 - IV четверть, в которой косинус имеет положительный знак => знак меняется")},
            "тригонометрия": {
                1: ("sin^2(a) + cos^2(a) =", "1", ""),
                2: ("1 + tg^2(a) =", "1/cos^2(a)", ""),
                3: ("1 + ctg^2(a) =", "1/sin^2(a)", ""),
                4: ("tg(a) * ctg(a) =", "1", "")},
            "угол": {
                1: ("sin(2a) =", "2sin(a) * cos(a)", ""),
                2: ("cos(2a) = cos^2(a) -", "sin^2(a)", ""),
                3: ("cos(2a) = 2cos^2(a) -", "1", ""),
                4: ("cos(2a) = 1 -", "2sin^2(a)", "")},
            "четность": {
                1: ("sin(-x) =", "-sin(x)", ""),
                2: ("cos(-x) =", "cos(x)", ""),
                3: ("tg(-x) =", "-tg(x)", ""),
                4: ("ctg(-x) =", "-ctg(x)", "")},
            "определение": {
                1: ("Если log(a, b) = c, то", "a^c = b", "")},
            "одз": {
                1: ("Для log(a, b) (через запятую):", "a > 0, a != 0, b > 0", "")},
            "тождество": {
                1: ("a^log(a, b) =", "b", "")},
            "свойства1": {
                1: ("log(a, b) + log(a, c) =", "log(a, (b*c)", ""),
                2: ("log(a, b) - log(a, c) =", "log(a, (b/c)", ""),
                3: ("log(a, b^m) =", "m * log(a, b)", ""),
                4: ("log(a^n, b) =", "1/n * log(a, b)", ""),
                5: ("log(a, b) = (без c)", "1/log(b, a)", ""),
                6: ("log(a, b) =", "log(c, b)/log(c, a)", "")},
            "модуль": {
                    1: ("y = |2 - 1| =", "2 - 1", ",\nвнутримодульное выражение положительное => просто опускаем модуль"),
                    2: ("y = |1 - 2| =", "-1 + 2", "\nвнутримодульное выражение отрицательное => меняем все знаки внутри модуля на положительные")},
            "свойства2": {
                    1: ("|a * b| =", "|a| * |b|", ""),
                    2: ("|a/b| =", "|a|/|b|", "")}
            }
